yanagiis/yo-kernel/include/arch/cortex_m/tm4c129e/memory_map.h
#ifndef ARCH_CORTEX_M_TM4C129X_MEMORY_MAP_H
#define ARCH_CORTEX_M_TM4C129X_MEMORY_MAP_H

#define TM4C129X_ONCHIP_FLASH (0x00000000)
#define TM4C129X_ONCHIP_ROM (0x02000000)
#define TM4C129X_ONCHIP_SRAM (0x20000000)
#define TM4C129X_PERIPH1_BASE (0x40000000)
#define TM4C129X_PERIPH1_END (0x60000000)

#define TM4C129X_PERIPH1_BITBAND_BASE (0x42000000)
#define TM4C129X_PERIPH1_BITBAND_ADDR(addr, bit)                               \
    ((TM4C129X_PERIPH1_BITBAND_BASE + ((addr - TM4C129X_PERIPH1_BASE) << 5)) + \
     (bit << 2))

// Peripheral
#define TM4C129X_WDG_TIMER0 (TM4C129X_PERIPH1_BASE + 0x0)
#define TM4C129X_WDG_TIMER1 (TM4C129X_PERIPH1_BASE + 0x1000)

#define TM4C129X_GPIOA (TM4C129X_PERIPH1_BASE + 0x4000)
#define TM4C129X_GPIOB (TM4C129X_PERIPH1_BASE + 0x5000)
#define TM4C129X_GPIOC (TM4C129X_PERIPH1_BASE + 0x6000)
#define TM4C129X_GPIOD (TM4C129X_PERIPH1_BASE + 0x7000)

#define TM4C129X_SSI0 (TM4C129X_PERIPH1_BASE + 0x8000)
#define TM4C129X_SSI1 (TM4C129X_PERIPH1_BASE + 0x9000)
#define TM4C129X_SSI2 (TM4C129X_PERIPH1_BASE + 0xA000)
#define TM4C129X_SSI3 (TM4C129X_PERIPH1_BASE + 0xB000)

#define TM4C129X_UART0 (TM4C129X_PERIPH1_BASE + 0xC000)
#define TM4C129X_UART1 (TM4C129X_PERIPH1_BASE + 0xD000)
#define TM4C129X_UART2 (TM4C129X_PERIPH1_BASE + 0xE000)
#define TM4C129X_UART3 (TM4C129X_PERIPH1_BASE + 0xF000)
#define TM4C129X_UART4 (TM4C129X_PERIPH1_BASE + 0x10000)
#define TM4C129X_UART5 (TM4C129X_PERIPH1_BASE + 0x11000)
#define TM4C129X_UART6 (TM4C129X_PERIPH1_BASE + 0x12000)
#define TM4C129X_UART7 (TM4C129X_PERIPH1_BASE + 0x13000)

#define TM4C129X_I2C0 (TM4C129X_PERIPH1_BASE + 0x20000)
#define TM4C129X_I2C1 (TM4C129X_PERIPH1_BASE + 0x21000)
#define TM4C129X_I2C2 (TM4C129X_PERIPH1_BASE + 0x22000)
#define TM4C129X_I2C3 (TM4C129X_PERIPH1_BASE + 0x23000)

#define TM4C129X_GPIOE (TM4C129X_PERIPH1_BASE + 0x24000)
#define TM4C129X_GPIOF (TM4C129X_PERIPH1_BASE + 0x25000)
#define TM4C129X_GPIOG (TM4C129X_PERIPH1_BASE + 0x26000)
#define TM4C129X_GPIOH (TM4C129X_PERIPH1_BASE + 0x27000)

#define TM4C129X_PWM0 (TM4C129X_PERIPH1_BASE + 0x28000)

#define TM4C129X_QEI0 (TM4C129X_PERIPH1_BASE + 0x2C000)

#define TM4C129X_TIMER0 (TM4C129X_PERIPH1_BASE + 0x30000)
#define TM4C129X_TIMER1 (TM4C129X_PERIPH1_BASE + 0x31000)
#define TM4C129X_TIMER2 (TM4C129X_PERIPH1_BASE + 0x32000)
#define TM4C129X_TIMER3 (TM4C129X_PERIPH1_BASE + 0x33000)
#define TM4C129X_TIMER4 (TM4C129X_PERIPH1_BASE + 0x34000)
#define TM4C129X_TIMER5 (TM4C129X_PERIPH1_BASE + 0x35000)

#define TM4C129X_ADC0 (TM4C129X_PERIPH1_BASE + 0x38000)
#define TM4C129X_ADC1 (TM4C129X_PERIPH1_BASE + 0x39000)
#define TM4C129X_ANALOG_COMPARATOR (TM4C129X_PERIPH1_BASE + 0x3C000)

#define TM4C129X_GPIOJ (TM4C129X_PERIPH1_BASE + 0x3D000)

#define TM4C129X_CAN0 (TM4C129X_PERIPH1_BASE + 0x40000)
#define TM4C129X_CAN1 (TM4C129X_PERIPH1_BASE + 0x41000)

#define TM4C129X_USB (TM4C129X_PERIPH1_BASE + 0x50000)

// TODO GPIO aperture

#define TM4C129X_EEPROM (TM4C129X_PERIPH1_BASE + 0xAF000)

#define TM4C129X_I2C8 (TM4C129X_PERIPH1_BASE + 0xB8000)
#define TM4C129X_I2C9 (TM4C129X_PERIPH1_BASE + 0xB9000)
#define TM4C129X_I2C4 (TM4C129X_PERIPH1_BASE + 0xC0000)
#define TM4C129X_I2C5 (TM4C129X_PERIPH1_BASE + 0xC1000)
#define TM4C129X_I2C6 (TM4C129X_PERIPH1_BASE + 0xC2000)
#define TM4C129X_I2C7 (TM4C129X_PERIPH1_BASE + 0xC3000)

#define TM4C129X_EPI0 (TM4C129X_PERIPH1_BASE + 0xD0000)

#define TM4C129X_TIMER6 (TM4C129X_PERIPH1_BASE + 0xE0000)
#define TM4C129X_TIMER7 (TM4C129X_PERIPH1_BASE + 0xE1000)

#define TM4C129X_ETHCTL (TM4C129X_PERIPH1_BASE + 0xEC000)

#define TM4C129X_SYS_EXCEPTION (TM4C129X_PERIPH1_BASE + 0xF9000)

#define TM4C129X_HIBERNATION (TM4C129X_PERIPH1_BASE + 0xFC000)

#define TM4C129X_FLASH (TM4C129X_PERIPH1_BASE + 0xFD000)

#define TM4C129X_SYSCTL (TM4C129X_PERIPH1_BASE + 0xFE000)

#define TM4C129X_UDMA (TM4C129X_PERIPH1_BASE + 0xFF000)

#define TM4C129X_CRYPTO (TM4C129X_PERIPH1_BASE + 0x4030000)
#define TM4C129X_SHA_MD5 (TM4C129X_PERIPH1_BASE + 0x4034000)
#define TM4C129X_AES (TM4C129X_PERIPH1_BASE + 0x4036000)
#define TM4C129X_DES (TM4C129X_PERIPH1_BASE + 0x4038000)

#define TM4C129X_EPHY0 (TM4C129X_PERIPH1_BASE + 0x4054000)

#endif  // ARCH_CORTEX_M_TM4C129X_MEMORY_MAP_H
